{"pages":[{"title":"about","text":"关于我关于咸鱼关于小泥潭","path":"about/index.html","date":"08-15","excerpt":""},{"title":"404","text":"","path":"404/index.html","date":"08-16","excerpt":""},{"title":"search","text":"","path":"search/index.html","date":"08-16","excerpt":""},{"title":"论则析理精微,铭则序事清润。","text":"","path":"message/index.html","date":"08-15","excerpt":""}],"posts":[{"title":"厌烦","text":"十分的厌烦自己厌烦那些乱七八糟的思想厌烦那些毫无理由的暴躁厌烦那些屡教不改的懒惰总之厌烦过去的我厌烦此刻的我未来的我，估计正在厌烦我~","path":"2018/08/21/厌烦/","date":"08-21","excerpt":""},{"title":"有点点蓝瘦","text":"人呐，毕竟都是有感情的失败的人呢，总是爱回忆过去，反正我是这样现在的我已经变成我曾经讨厌的模样，但是可笑的是，我发现了还有更加讨厌的模样，你说那会不会就是我的下一站？其实很想有人能够聊聊天，可是不善交际的我现在几乎是没有任何聊天对象马上开学就大四了，没有拿得出手的东西，没有可称赞的能力，也没有什么可交流的同好，可以说，三年，无所事事！大一还有些憧憬 ，大二有些逃避，大三则是愧疚和麻木，马上大四了，现在剩下的是什么？大概是愤怒吧，无关外界的愤怒，仅仅是对于自身的愤怒！也有悲哀，无奈，寂寞。哎，蓝瘦！","path":"2018/08/16/有点点蓝瘦/","date":"08-16","excerpt":""},{"title":"咸鱼椰壳","text":"从昨晚上折腾到现在，主题都不记得换了多少个，总算是初步完成了 以后有机会有时间一定要学学怎么做的主题现在就先借着大佬们的主题来用用吧感谢大佬","path":"2018/08/15/咸鱼椰壳/","date":"08-15","excerpt":"从昨晚上折腾到现在，主题都不记得换了多少个，总算是初步完成了"},{"title":"没什么的图文","text":"随便贴点图鼓捣大半天呐，发现前端真的很有意思，不过暂时我是没时间去了解学习了 没什么一号 没什么二号 没什么三号","path":"2018/08/14/没什么的图文/","date":"08-14","excerpt":""},{"title":"Schedule","text":"数学和英语就是以后行走人生的双腿，支撑着去领略世间的美好。而对于此刻的我，正如一个没有双腿的人。 五点半起床的习惯刚刚要养成，就被这几天杂乱的作息彻底拖垮。本来五点二十多分自然醒，现在却需要到六点多，功亏一篑呐。不能坚持，那么之前所做的一切努力都将白费！保持出门，不要再整日窝在宿舍，多出去见见外面的风光，只要走出去了，怎么样都比在宿舍要好很多，比如，可以收敛起那些阴暗面，善养吾浩然之气~晚上别搞太晚，懂得敬畏自己，爱护自己的身体，爱那些爱我厌我无关我的人（什么鬼？神爱世人啊？病得不轻）~说的若能做到，那便是极为让人愉悦的~ 看专业课，看英语，看数学。。。。好好学习~","path":"2018/08/06/Schedule/","date":"08-06","excerpt":"数学和英语就是以后行走人生的双腿，支撑着去领略世间的美好。而对于此刻的我，正如一个没有双腿的人。"},{"title":"没有东西","text":"最近在看数据结构，希望能够有些收获，并能够记录下来。算是个读书笔记吧。不过能不能持续的写下去才是最大的问题！ 就不能立flag，昨天早上刚决定，然后昨天一天就没有看数据结构，无fuck说~ 目前看了线性表的顺序存储和链式存储的实现，我这水平，连爬都不算，还差得太远啊，继续吧，希望有天能在我的GitHub上看到一堆自己实现的算法……","path":"2018/08/02/没有东西/","date":"08-02","excerpt":"最近在看数据结构，希望能够有些收获，并能够记录下来。"},{"title":"无意义","text":"虚假时间尝试更改时间来发博现在在八月二号早上写下八月一号的文 不过感觉个人博应该都是可以更改时间的吧，不过这好像没什么实际意义，我也实在无聊才会想到这些，纯粹是拿来浪费时间的。说到浪费时间，我觉得我没有资格再去说珍惜时间之类的话了，太恬不知耻了。","path":"2018/08/01/无意义/","date":"08-01","excerpt":""},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","path":"2018/07/22/hello-world/","date":"07-22","excerpt":""}]}