{"pages":[{"title":"论则析理精微,铭则序事清润。","text":"","path":"message/index.html","date":"08-15","excerpt":""},{"title":"about","text":"关于我关于咸鱼关于小泥潭","path":"about/index.html","date":"08-15","excerpt":""}],"posts":[{"title":"咸鱼椰壳","text":"从昨晚上折腾到现在，主题都不记得换了多少个，总算是初步完成了 以后有机会有时间一定要学学怎么做的主题现在就先借着大佬们的主题来用用吧感谢大佬","path":"2018/08/15/咸鱼椰壳/","date":"08-15","excerpt":"从昨晚上折腾到现在，主题都不记得换了多少个，总算是初步完成了"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","path":"2018/08/15/hello-world/","date":"08-15","excerpt":""},{"title":"没什么的图文","text":"随便贴点图鼓捣大半天呐，发现前端真的很有意思，不过暂时我是没时间去了解学习了 没什么一号 没什么二号 没什么三号","path":"2018/08/14/没什么的图文/","date":"08-14","excerpt":""},{"title":"Schedule","text":"数学和英语就是以后行走人生的双腿，支撑着去领略世间的美好。而对于此刻的我，正如一个没有双腿的人。 五点半起床的习惯刚刚要养成，就被这几天杂乱的作息彻底拖垮。本来五点二十多分自然醒，现在却需要到六点多，功亏一篑呐。不能坚持，那么之前所做的一切努力都将白费！保持出门，不要再整日窝在宿舍，多出去见见外面的风光，只要走出去了，怎么样都比在宿舍要好很多，比如，可以收敛起那些阴暗面，善养吾浩然之气~晚上别搞太晚，懂得敬畏自己，爱护自己的身体，爱那些爱我厌我无关我的人（什么鬼？神爱世人啊？病得不轻）~说的若能做到，那便是极为让人愉悦的~ 看专业课，看英语，看数学。。。。好好学习~","path":"2018/08/06/Schedule/","date":"08-06","excerpt":"数学和英语就是以后行走人生的双腿，支撑着去领略世间的美好。而对于此刻的我，正如一个没有双腿的人。"},{"title":"没有东西","text":"最近在看数据结构，希望能够有些收获，并能够记录下来。算是个读书笔记吧。不过能不能持续的写下去才是最大的问题！ 就不能立flag，昨天早上刚决定，然后昨天一天就没有看数据结构，无fuck说~ 目前看了线性表的顺序存储和链式存储的实现，我这水平，连爬都不算，还差得太远啊，继续吧，希望有天能在我的GitHub上看到一堆自己实现的算法……","path":"2018/08/02/没有东西/","date":"08-02","excerpt":"最近在看数据结构，希望能够有些收获，并能够记录下来。"},{"title":"无意义","text":"虚假时间尝试更改时间来发博现在在八月二号早上写下八月一号的文 不过感觉个人博应该都是可以更改时间的吧，不过这好像没什么实际意义，我也实在无聊才会想到这些，纯粹是拿来浪费时间的。说到浪费时间，我觉得我没有资格再去说珍惜时间之类的话了，太恬不知耻了。","path":"2018/08/01/无意义/","date":"08-01","excerpt":""},{"title":"Hello,Hexo!","text":"总之就是各种无聊 二零一八年七月二十九之前没啥，都忘得差不多了，感觉接下来的日子短期应该不会有什么大的变化。 二零一八年七月二〇一八年七月二十九日中午无聊，突然想找个事做，便决定每天记录一下吧，唉，无聊的流水账~~ 二〇一八年七月三十日突然抽风想做个小游戏，免费的虚幻引擎想去了解一下，游戏主题就以建大生活为主，旨在通过生存模拟游戏来……额 ……来干嘛我也不知道，反正就是在建大的日常生活吧，也有点新生注意事项的意思。不过最大的问题，现在要考研啊，没时间啊，好想问问自己，前几年干嘛去了啊，那时间浪费的真是心疼，太奢侈了。下次去教室就不能带手机了，中午回来要睡一会，胡思乱想尽量去克制，要学会控几住我记几，深知时间紧迫，仍能够去坦然的浪费，真是搞不懂是怎么想的，这样下去真是注定要玩完啊！ 二〇一八年七月三十一日我打多少号就是多少号，若没有持之以恒，那便是自我欺骗。 二零一八年八月二〇一八年八月一日在教室越来越难以集中注意去学习，不断的犯困，一看书就困，烦啊~ 二〇一八年八月二日又在八月三号早上才写下八月二号，这一天天的，已经废了。起床时间过了五点半，都五十了才自然醒，和前几天的半点自然醒差了好多，这是否意味着我的内心的松懈和怠惰，我想应该是有关系的。而且这两天朋友叫我打游戏我没有拒绝，这也是一个主要的问题。最近又开始自作多情了，一些无谓的内心戏都是智障。想要什么就去追求啊，整天沉浸在自我有毛用！！！ 二〇一八年八月三日无话可说 二〇一八年八月六日不要问四号五号去了哪里，鬼知道~来波21天计划吧，正好还有差不多21天就生日了，这就算是给自己的生日礼物，强制执行21天，我可不希望到时候学狗叫啊~ 二〇一八年八月七日还算是充实的，比起之前，真的可以说是没有荒废了~午休时间还是过于久了，睡了两三个小时，真是属猪的啊，下次不能再睡这么久了~对于感兴趣的东西还是比较容易投入进去，C语言实现单链表，不知不觉看了三四个小时，看了结构体的定义，指针域，数据域，勉强算是有些小收获吧，不过仍需继续努力~ 二〇一八年八月八日早起跑步+晚上跑步=胳膊酸痛搞不懂啊，腿都不疼胳膊疼！专业课好多啊，这才开始看第一门第一章，压力很大啊数学要按部就班，英语要坚持下去，专业课也要统筹兼顾，时间真是紧张，可我依旧在浪费大多~ 二〇一八年八月九日胳膊疼一天也是够了，说好的21天计划，目前是坚持的还行，当然一些旁支末节。。。嗯。。也很重要英语还没看，一会睡前赶紧看看，今日事今日毕喽，拖到明天，英语又是要凉凉，这未来的大腿啊~厌烦的东西若能无视之，那感觉，舒畅~ 二〇一八年八月十日今天算是废了啊，一大早就碰到腌臜人的东西，整个人都变得不好了为什么会有这样的存在呢？躲开都会被波及到无视之!无视之!无视之！哪怕是没有比得上的东西，可内心深处依旧是可以有权力无视之！很优秀是没错，可并不妨碍我的看法，并不会因为优秀而有所改观~我还差得远，仍需努力，今天的浪费太过可耻，也是没法有效控制自己情绪的表现~引以为戒！ 二〇一八年八月十一日GitHub无法载入什么鬼，是被关外面了吗？ 二〇一八年八月十二日天气渐渐能够感到些许凉意难道是我DNS改了的原因，搞得GitHub和网易云音乐都崩了，现在改回来好像又可以了，这些东西原理好像也是考察范围。这两天好像又开始有点懈怠了。想要反省吾日三省吾身。。。 二〇一八年八月十三日整了一下午的线性表顺序存储的实现，我这智商真的堪忧啊数学开始学不动了，英语也不想背了，搞什么啊这才几天啊，可不能放弃了，坚持坚持，努力努力~ 二〇一八年八月十四日每日计划？不存在的，无非是早上运动，上午三小时数学，下午三小时数学加英语，晚上专业课，实话说，每天都是想的挺美~~——————5：48 二〇一八年八月十五日话说今天没有早起，晚了一个多小时没看数学没看英语与其自怨自艾，不如马上行动执行力真的很重要","path":"2018/07/23/Hello,Hexo!/","date":"07-23","excerpt":"总之就是各种无聊"}]}